apache/nuttx/arch/arm/src/stm32l4/hardware/stm32l4xrxx_rcc.h
#define RCC_CRRCR_HSI48CAL_SHIFT    7
#  define RCC_CRRCR_HSI48CAL_MASK   (0x01ff << RCC_CRRCR_HSI48CAL_SHIFT) /* HSI48 clock calibration */

#define RCC_CRRCR_HSI48ON           (1 << 0)  /* Bit 0: HSI48 clock enable */
#define RCC_CRRCR_HSI48RDY          (1 << 1)  /* Bit 1: HSI48 clock ready flag */

/* Peripheral Independent Clock Configuration 2 register */

#define RCC_CCIPR2_I2C4SEL_SHIFT       (0)       /* Bits 0-1: I2C4 clock source selection */
#define RCC_CCIPR2_I2C4SEL_MASK        (3 << RCC_CCIPR2_I2C4SEL_SHIFT)
#  define RCC_CCIPR2_I2C4SEL_PCLK      (0 << RCC_CCIPR2_I2C4SEL_SHIFT)
#  define RCC_CCIPR2_I2C4SEL_SYSCLK    (1 << RCC_CCIPR2_I2C4SEL_SHIFT)
#  define RCC_CCIPR2_I2C4SEL_HSI       (2 << RCC_CCIPR2_I2C4SEL_SHIFT)

#define RCC_CCIPR2_DFSDMSEL            (1 << 2)  /* Bit 2: Digital filter for sigma delta modulator kernel clock source */

#  define RCC_CCIPR2_DFSDMSEL_APB2     0                         /* APB2 clock (PCLK2) selected */
#  define RCC_CCIPR2_DFSDMSEL_PCLK     RCC_CCIPR2_DFSDMSEL       /* System clock selected */

#define RCC_CCIPR2_ADFSDMSEL_SHIFT     (3)       /* Bits 3-4: Digital filter for sigma delta modulator audio clock source */
#define RCC_CCIPR2_ADFSDMSEL_MASK      (3 << RCC_CCIPR2_ADFSDMSEL_SHIFT)
#  define RCC_CCIPR2_ADFSDMSEL_SAI1    (0 << RCC_CCIPR2_ADFSDMSEL_SHIFT)
#  define RCC_CCIPR2_ADFSDMSEL_HSI     (1 << RCC_CCIPR2_ADFSDMSEL_SHIFT)
#  define RCC_CCIPR2_ADFSDMSEL_MSI     (2 << RCC_CCIPR2_ADFSDMSEL_SHIFT)

#define RCC_CCIPR2_SAI1SEL_SHIFT       (5)       /* Bits 5-7: SAI1 clock source selection */
#define RCC_CCIPR2_SAI1SEL_MASK        (7 << RCC_CCIPR2_SAI1SEL_SHIFT)
#  define RCC_CCIPR2_SAI1SEL_PLLSAI1   (0 << RCC_CCIPR2_SAI1SEL_SHIFT)
#  define RCC_CCIPR2_SAI1SEL_PLLSAI2   (1 << RCC_CCIPR2_SAI1SEL_SHIFT)
#  define RCC_CCIPR2_SAI1SEL_PLLSAI3   (2 << RCC_CCIPR2_SAI1SEL_SHIFT)
#  define RCC_CCIPR2_SAI1SEL_SAI1_EXT  (3 << RCC_CCIPR2_SAI1SEL_SHIFT)
#  define RCC_CCIPR2_SAI1SEL_HSI       (4 << RCC_CCIPR2_SAI1SEL_SHIFT)

#define RCC_CCIPR2_SAI2SEL_SHIFT       (8)       /* Bits 8-10: SAI2 clock source selection */
#define RCC_CCIPR2_SAI2SEL_MASK        (7 << RCC_CCIPR2_SAI2SEL_SHIFT)
#  define RCC_CCIPR2_SAI2SEL_PLLSAI1   (0 << RCC_CCIPR2_SAI2SEL_SHIFT)
#  define RCC_CCIPR2_SAI2SEL_PLLSAI2   (1 << RCC_CCIPR2_SAI2SEL_SHIFT)
#  define RCC_CCIPR2_SAI2SEL_PLLSAI3   (2 << RCC_CCIPR2_SAI2SEL_SHIFT)
#  define RCC_CCIPR2_SAI2SEL_SAI2_EXT  (3 << RCC_CCIPR2_SAI2SEL_SHIFT)
#  define RCC_CCIPR2_SAI2SEL_HSI       (4 << RCC_CCIPR2_SAI2SEL_SHIFT)

#endif /* CONFIG_STM32L4_STM32L4XR */
#endif /* __ARCH_ARM_SRC_STM32L4_HARDWARE_STM32L4XRXX_RCC_H */
